import React from "react";
import { Grid, Typography } from "@material-ui/core";
import Colors from "../utilities/Colors";
export default function (props) {
	return (
		<Grid
			container
			justify="flex-start"
			wrap="nowrap"
			style={{ marginBottom: 32, paddingLeft: "5%", paddingRight: "5%" }}>
			<div
				style={{
					minHeight: 20,
					paddingLeft: 4,
					paddingRight: 4,
					width: 8,
					borderRadius: 4,
					backgroundColor: Colors.primary,
				}}></div>
			<Typography
				variant="body1"
				wrap
				style={{
					textAlign: "justify",
					fontFamily: "myFirstFont",
					paddingRight: "2%",
				}}>
				"داداشم ادیداداشم ادیسونداداشم ادیسونداداشم ادیسونداداشم ادیسون داداشم
				ادیسونداداشم ادیسون داداشم ادیسون داداشم ادیسونداداشم ادیسونداداشم
				ادیسونداداشم ادیسونداداشم ادیسونداداشم ادیسونداداشم ادیسون داداشم
				ادیسونداداشم ادیسونداداشم ادیسونسونداداشم ادیداداشم ادیسونداداشم
				ادیسونداداشم ادیسونداداشم ادیسون داداشم ادیسونداداشم ادیسون داداشم
				ادیسون داداشم ادیسونداداشم ادیسونداداشم ادیسونداداشم ادیسونداداشم
				ادیسونداداشم ادیسونداداشم ادیسون داداشم ادیسونداداشم ادیسونداداشم
				ادیسونسونداداشم ادیداداشم ادیسونداداشم ادیسوندااشم ادیسونداداشم
				ادیسونداداشم ادیسونداداشم ادیسونداداشم ادیسونداداشم ادیسون داداشم
				ادیسونداداشم ادیسونداداشم ادیسونسونداداشم ادیداداشم ادیسونداداشم
				ادیسونداداشم ادیسونداداشم ادیسون داداشم ادیسونداداشم ادیسون داداشم
				ادیسون داداشم ادیسونداداشم ادیسونداداشم ادیسونداداشم ادیسونداداشم
				ادیسونداداشم ادیسونداداشم ادیسون داداشم ادیسونداداشم ادیسونداداشم
				ادیسونسون"
				{/* {props.text} */}
			</Typography>
		</Grid>
	);
}
